samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
    // Initialize interrupt handler flags and enable the interrupt handler 
    int_handler_init(); 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_15); 

    // Thread definition, queue handle creation and dispatch function assignment 
    thread_low_trackers.event_data = 
    {
        .attr = { .name = "ThreadLow", 
                  .attr_bits = CLEAR, 
                  .cb_mem = NULL, 
                  .cb_size = CLEAR, 
                  .stack_mem = NULL, 
                  .stack_size = THREAD_LOW_STACK_SIZE, 
                  .priority = (osPriority_t)osPriorityLow, 
                  .tz_module = CLEAR, 
                  .reserved = CLEAR }, 
        .event = CLEAR, 
        .ThreadEventQueue = xQueueCreate(thread_low_queue_len, sizeof(uint32_t)), 
        .dispatch = DispatchThreadLow 
    }; 
    // Check that the queues were created successfully 

    // Create the thread(s) 
    osThreadNew(
        eventLoop, 
        (void *)&thread_low_trackers.event_data, 
        &thread_low_trackers.event_data.attr); 
    // Check that the thread creation worked 

    uart_sendstring(USART2, "\r\n>>> "); 

    //==================================================

    //==================================================
    // High Priority Thread 

    // Initialize general data 
    thread_high_trackers.state = THREAD_HIGH_LED_SLOW_STATE; 
    thread_high_trackers.led_gpio = GPIOA; 
    thread_high_trackers.led_pin = GPIOX_PIN_5; 
    thread_high_trackers.led_state = GPIO_LOW; 
    thread_high_trackers.state_entry = SET_BIT; 
    thread_high_trackers.state_change = CLEAR_BIT; 
    thread_high_trackers.led_slow = SET_BIT; 
    thread_high_trackers.led_fast = CLEAR_BIT; 

    // Initialize board LED (on when logic low) 
    gpio_pin_init(GPIOA, PIN_5, MODER_GPO, OTYPER_PP, OSPEEDR_HIGH, PUPDR_NO); 

    // Thread definition, queue handle creation and dispatch function assignment 
    thread_high_trackers.event_data = 
    {
        .attr = { .name = "ThreadHigh", 
                  .attr_bits = CLEAR, 
                  .cb_mem = NULL, 
                  .cb_size = CLEAR, 
                  .stack_mem = NULL, 
                  .stack_size = THREAD_HIGH_STACK_SIZE, 
                  .priority = (osPriority_t)osPriorityHigh, 
                  .tz_module = CLEAR, 
                  .reserved = CLEAR }, 
        .event = THREAD_HIGH_NO_EVENT, 
        .ThreadEventQueue = xQueueCreate(thread_high_queue_len, sizeof(uint32_t)), 
        .dispatch = DispatchThreadHigh 
    }; 
    // Check that the queues were created successfully 

    // Create the thread(s) 
    osThreadNew(
        eventLoop, 
        (void *)&thread_high_trackers.event_data, 
        &thread_high_trackers.event_data.attr); 
    // Check that the thread creation worked 

    // Queue and empty event to start the LED blinks 
    xQueueSend(thread_high_trackers.event_data.ThreadEventQueue, 
        (void *)&thread_high_trackers.event_data.event, 0); 
    
    //==================================================

    //==================================================
    // Software Timer Thread 

    // Create timers 
    thread_high_trackers.slow_blink_timer = xTimerCreate(
        "one_shot_timer",               // Name of timer 
        LED_SLOW_BLINK_PERIOD,          // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)0,                      // Timer ID 
        LEDTimerCallback);              // Callback function 
    thread_high_trackers.fast_blink_timer = xTimerCreate(
        "one_shot_timer",               // Name of timer 
        LED_FAST_BLINK_PERIOD,          // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)1,                      // Timer ID 
        LEDTimerCallback);              // Callback function 
    // Check that timers were created successfully 

    //==================================================
}

#endif 

//=======================================================================================


//=======================================================================================
// Active Object control 

// In practice the event loop and any other context switching or thread related code 
// should be in it's own file. The event loop would then dispatch to the thread it's 
// running in a different file. 

// Common event loop shared by all threads 
void eventLoop(void *thread_info)
{
    ThreadEventData *thread = (ThreadEventData *)thread_info; 

    // Event loop 
    while (1)
    {
        thread->event = CLEAR; 
        xQueueReceive(thread->ThreadEventQueue, (void *)&thread->event, portMAX_DELAY); 
        thread->dispatch(thread->event); 
    }

    vTaskDelete(NULL); 
}

//=======================================================================================


//=======================================================================================
// Low Priority Thread control 

#if AO_CPP_TEST 

// Low Priority Thread: Dispatch 
void SystemData::DispatchThreadLow(Event event)
{
    ThreadLowStates state = thread_low_state; 

    // Continuous events. These are thread events that happen irrespective of state. 

    // State machine 
    switch (state)
    {
        case ThreadLowStates::SERIAL_OUT_STATE: 
            if (thread_low_flags.serial_in)
            {
                state = ThreadLowStates::SERIAL_IN_STATE; 
            }
            break; 
        
        case ThreadLowStates::SERIAL_IN_STATE: 
            if (thread_low_flags.serial_out)
            {
                state = ThreadLowStates::SERIAL_OUT_STATE; 
            }
            break; 

        default: 
            state = ThreadLowStates::SERIAL_OUT_STATE; 
            break; 
    }

    // Run state function 
    thread_low_state_table[(uint8_t)state](this, event); 
    thread_low_state = state; 

    this; 
}

// Low Priority Thread: State 0 
void SystemData::ThreadLowState0(
    SystemData *data, 
    Event event)
{
    // State entry 
    if (data->thread_low_flags.state_entry)
    {
        data->thread_low_flags.state_entry = CLEAR_BIT; 
    }

    // Event selection 
    switch (event)
    {
        case ThreadLowEvents::SERIAL_OUT_EVENT: 
            SerialOutEvent((char *)data->user_in_buff); 
            break; 

        default: 
            break; 
    }

