samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
// High Priority Thread: State 1 
void ThreadHighState1(
    ThreadHighTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_high_trackers.state_entry)
    {
        thread_high_trackers.state_entry = CLEAR_BIT; 

        xTimerStart(thread_high_trackers.fast_blink_timer, 0); 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_HIGH_LED_TOGGLE_EVENT: 
            PinToggleEvent(
                thread_high_trackers.led_gpio, 
                thread_high_trackers.led_pin, 
                &thread_high_trackers.led_state); 

            if (thread_high_trackers.state_change)
            {
                thread_high_trackers.state_change = CLEAR_BIT; 
                thread_high_trackers.led_slow = SET_BIT; 

                // Trigger the next state with an empty event 
                ThreadHighStateTrigger(); 
            }
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_high_trackers.led_slow)
    {
        thread_high_trackers.state_entry = SET_BIT; 
        thread_high_trackers.led_fast = CLEAR_BIT; 

        xTimerStop(thread_high_trackers.fast_blink_timer, 0); 
    }
}


// Toggle the high priority thread state 
void ThreadHighStateToggle(void)
{
    thread_high_trackers.state_change = SET_BIT; 
}


// Trigger/start the next state 
void ThreadHighStateTrigger(void)
{
    // Queue an empty event to get the thread to change states and start blinking the 
    // LED at an updated rate immediately. 
    thread_high_trackers.event_data.event = THREAD_HIGH_NO_EVENT; 
    xQueueSend(thread_high_trackers.event_data.ThreadEventQueue, 
        (void *)&thread_high_trackers.event_data.event, 0); 
}

#endif 

//=======================================================================================


//=======================================================================================
// Software Timer Thread 

// Software Timer Callback: LED toggle 

#if AO_CPP_TEST 

void SystemData::LEDTimerCallback(TimerHandle_t xTimer)
{
    // Queue an LED toggle event 
    thread_high_event_data.event = ThreadHighEvents::LED_TOGGLE_EVENT; 
    xQueueSend(thread_high_event_data.ThreadEventQueue, 
        (void *)&thread_high_event_data.event, 0); 
}

#elif AO_C_TEST 

void LEDTimerCallback(TimerHandle_t xTimer)
{
    // Queue an LED toggle event 
    thread_high_trackers.event_data.event = THREAD_HIGH_LED_TOGGLE_EVENT; 
    xQueueSend(thread_high_trackers.event_data.ThreadEventQueue, 
        (void *)&thread_high_trackers.event_data.event, 0); 
}

#endif 

//=======================================================================================


//=======================================================================================
// Event modules 

// In practice these would be independent modules that can be used wherever needed. 

// Event: Serial Output 
void SerialOutEvent(char *output_buff)
{
    if (output_buff != NULL)
    {
        // Output the latest content of the circular buffer to the serial terminal 
        uart_sendstring(USART2, "Echo: "); 
        uart_sendstring(USART2, output_buff); 
        uart_sendstring(USART2, "\r\n>>> "); 
    }
}


// Event: Serial Input 
void SerialInEvent(
    uint8_t *circular_buff, 
    uint8_t *circular_buff_index, 
    uint8_t *input_buff)
{
    handler_flags.usart2_flag = CLEAR; 

    // Get the user input from the circular buffer 
    cb_parse(
        circular_buff, 
        input_buff, 
        circular_buff_index, 
        SERIAL_INPUT_MAX_LEN); 
}


// Event: Pin Toggle (used to toggle the board LED) 
void PinToggleEvent(
    GPIO_TypeDef *pin_gpio, 
    gpio_pin_num_t pin_num, 
    gpio_pin_state_t *pin_state)
{
    *pin_state = (gpio_pin_state_t)(GPIO_HIGH - *pin_state); 
    gpio_write(pin_gpio, pin_num, *pin_state); 
}

//=======================================================================================
